{
  "intents": [
    {
      "intent": "greeting",
      "utterances": ["hello", "hi", "good morning", "good evening"],
      "responses": ["Hello! How can I help you today?", "Hi there! What's up?", "Good morning! How are you?", "Good evening! What can I do for you?"],
      "context": [""]
    },
    {
      "intent": "goodbye",
      "utterances": ["bye", "see you later", "talk to you later"],
      "responses": ["Goodbye! Have a nice day.", "See you later! Let me know if you need anything else.", "Talk to you later! I'm here if you need me."],
      "context": [""]
    },
    {
      "intent": "ask_name",
      "utterances": ["what's your name?", "what do you call yourself?", "what's your name, chatbot?"],
      "responses": ["My name is Bard. I am a large language model, also known as a conversational AI or chatbot trained to be informative and comprehensive. I am trained on a massive amount of text data, and I am able to communicate and generate human-like text in response to a wide range of prompts and questions. For example, I can provide summaries of factual topics or create stories."],
      "context": [""]
    },
    {
      "intent": "tell_me_a_joke",
      "utterances": ["tell me a joke", "do you know any jokes?", "make me laugh"],
      "responses": ["Sure, here's a joke: What do you call a fish with no eyes? Fsh! Here's another one: Why did the scarecrow win an award? Because he was outstanding in his field! How about this one: What do you call a lazy kangaroo? A pouch potato!"],
      "context": [""]
    },
    {
      "intent": "weather",
      "utterances": ["what's the weather like today?", "is it going to rain tomorrow?", "what's the temperature in New York City?"],
      "responses": ["The weather in San Francisco today is sunny with a high of 75 degrees Fahrenheit and a low of 55 degrees Fahrenheit. There is a 0% chance of rain.", "The weather in New York City tomorrow is cloudy with a high of 65 degrees Fahrenheit and a low of 45 degrees Fahrenheit. There is a 20% chance of rain."],
      "context": [""]
    }
  ]
}
